

Service_roleEnum = [("0","护士"), ("1","医生助理"), ("2","化验"), ("3","康复理疗师"), ("4","药士"), ("5","中医师"), ("6","医生"), ("7","质量管理"), ("8","健康管理师"), ("9","影像医师"), ("10","公卫"), ("11","药剂师"), ("12","管理者"), ]

GenderEnum = [("0","女"), ("1","男"), ]

Time_period_expressionEnum = [("0","3个月"), ("1","一年以上"), ("2","1个月"), ("3","半年以上"), ("4","0个月"), ]

Marital_statusEnum = [("0","未婚"), ("1","丧偶"), ("2","离异"), ("3","已婚"), ]

EducationEnum = [("0","中专技校"), ("1","小学"), ("2","初中"), ("3","硕士"), ("4","文盲或半文盲"), ("5","本科"), ("6","高中"), ("7","博士"), ("8","大专"), ]

Institutions_listEnum = []

Occupational_statusEnum = [("0","退休"), ("1","失业"), ("2","在职"), ]

NationalityEnum = [("0","少数民族"), ("1","汉族"), ]

SatisfactionEnum = [("0","既非满意也非不满意"), ("1","不满意"), ("2","很不满意"), ("3","很满意"), ("4","满意"), ]

Medical_expenses_burdenEnum = [("0","公费"), ("1","城镇居民医疗保险"), ("2","职工医疗保险"), ("3","自费"), ("4","商业保险"), ("5","贫困救助"), ]

Type_of_residenceEnum = [("0","常住"), ("1","非常住"), ]

Blood_typeEnum = [("0","AB+型"), ("1","B+型"), ("2","O型"), ("3","A型"), ("4","A-型"), ("5","AB-型"), ("6","B型"), ("7","AB型"), ("8","O-型"), ("9","O+型"), ("10","B-型"), ("11","A+型"), ("12","不详"), ]

Contract_signatoryEnum = [("0","是"), ("1","否"), ]

Genetic_diseaseEnum = [("0","无"), ("1","有"), ]

Employee_listEnum = []

Drug_listEnum = []

Family_relationshipEnum = [("0","户主"), ("1","配偶"), ("2","父母"), ("3","孙子女"), ("4","兄弟姐妹"), ("5","子女"), ("6","祖父母"), ("7","其他成员"), ]

ChooseEnum = [("0","不确定"), ("1","是"), ("2","否"), ("3","无"), ("4","有"), ]

Life_eventEnum = [("0","子女死亡"), ("1","离婚"), ("2","结婚"), ("3","父母死亡"), ("4","失业"), ("5","恋爱"), ("6","生子"), ("7","丧偶"), ("8","家属病重"), ]

FrequencyEnum = [("0","从不"), ("1","偶尔"), ("2","经常"), ]

Degree_expressionEnum = [("0","不困难"), ("1","非常糟"), ("2","一般"), ("3","非常好"), ("4","很难"), ("5","有一定影响"), ("6","不太好"), ("7","不适合"), ("8","很少有"), ("9","还不错"), ("10","比较容易"), ("11","非常不方便"), ("12","很适合"), ("13","很不合适"), ("14","非常方便"), ("15","无影响"), ("16","根本没有"), ("17","比较有"), ("18","不方便"), ("19","有点难"), ("20","适合"), ("21","很容易"), ("22","不太影响"), ("23","轻"), ("24","极有"), ("25","中"), ("26","比较方便"), ("27","有极大影响"), ("28","重"), ]

Comparative_expressionEnum = [("0","有一定改善"), ("1","改善很大"), ("2","变更差了"), ("3","没变化"), ]